geodetic-metrology-tools/LGC2/source/LSCalculation/TLSResultsMatricesExtractor.cpp
#include "TLSResultsMatricesExtractor.h"
#include "TLGCData.h"
#include "TLSResultsMatrices.h"



TLSResultsMatricesExtractor::TLSResultsMatricesExtractor(TLGCData* fData):
fDataSet(fData),
fLastIteration(false)
{}

TLSResultsMatricesExtractor::~TLSResultsMatricesExtractor()
{//Destructor
}
/////////////////////////////////////////////////////////////////
// PUBLIC METHODS
/////////////////////////////////////////////////////////////////
bool TLSResultsMatricesExtractor::extractResults(const TLSResultsMatrices& rm, TReal convCrit) {
	bool successfullExtraction = true;

	try{
		bool pt = extractPointParams(rm, convCrit);
		bool angl = extractAngleParams(rm, convCrit);
		bool pln = extractPlaneParams(rm, convCrit);
		bool len = extractLengthParams(rm, convCrit);
		bool trf = extractTransformationParams(rm, convCrit);
		bool ln = extractLineParams(rm, convCrit);

		if ( (pt && angl && pln && trf && len && ln) || fDataSet->getConfig().allfixed.isActive() )
			fLastIteration = true;

	}
	catch (std::exception const & excp) {
		fDataSet->getFileLogger() << TFileLogger::e_logType::LOG_ERROR <<  excp.what();
		successfullExtraction = false;
		return successfullExtraction;
	}
	return successfullExtraction;
}

bool TLSResultsMatricesExtractor::extractResiduals(const TLSResultsMatrices& rm) {

	bool successfullExtraction = true;

	try{
		// Iteration through nodes of the LOR tree
		for (TDataTreeIterator itTree = fDataSet->getTree().begin(); itTree != fDataSet->getTree().end(); itTree++){		
			// Iterate through the Total station measurements (TSTN)
			for(auto itTSTN(itTree.node->data->measurements.fTSTN.begin()); itTSTN != itTree.node->data->measurements.fTSTN.end(); ++itTSTN){
				// Iterate through every ROM of TSTN 
				for(auto itROM(itTSTN->roms.begin()); itROM != itTSTN->roms.end(); ++itROM){
					for(auto& itANGL:itROM->measANGL)
						extractAngleObs(rm, itANGL); //Extract residuals of ANGL

					for(auto& itZEND:itROM->measZEND)
						extractAngleObs(rm, itZEND); //Extract residuals of ZEND, same extractor used for both angle measurements

					for(auto& itDIST:itROM->measDIST)
						extractDistObs( rm, itDIST); //Extract residuals of DIST

					for(auto& itDHOR:itROM->measDHOR)
						extractDistObs(rm, itDHOR); //Extract residuals of DHOR
			
					for(auto& itPLR3D:itROM->measPLR3D)
						extractPLR3DObs(rm, itPLR3D);  //Extract residuals of PLR3D measurement
					
					for(auto& itECTH:itROM->measECTH){
						extractDistObs(rm, itECTH);
					}
					
				}
			}

			//Iterate through camera (CAM) measurements
			for(auto itCAM(itTree.node->data->measurements.fCAM.begin()); itCAM != itTree.node->data->measurements.fCAM.end(); ++itCAM){
				for(auto& itUVD:itCAM->measUVD)
					extractUVDObs(rm, itUVD);

				for(auto& itUVEC:itCAM->measUVEC)
					extractUVECObs(rm, itUVEC);
			}
			

			//In every node iterate through the EDM's measurements
			for(auto itEDM(itTree.node->data->measurements.fEDM.begin()); itEDM != itTree.node->data->measurements.fEDM.end(); ++itEDM){
				//Iterate through DPST measurements
				for(auto& itDPST:itEDM->measDSPT){	
					extractDSPTObs(rm, itDPST);
				}
			}
			

			//In every node iterate through the LEVEL's measurements
			for(auto& itLEVEL:itTree.node->data->measurements.fLEVEL)
				extractLEVELObs(rm, itLEVEL);

			//In every node iterate through the ECHOROM's measurements
			for(auto& itECHO:itTree.node->data->measurements.fECHO)
				extractECHOROMObs(rm, itECHO);

			//In every node iterate through the ECSPROM's measurements
			for (auto& itECSP:itTree.node->data->measurements.fECSP)
				extractECSPROMObs(rm, itECSP);

			//In every node iterate through the ECVEROM's measurements
			for (auto& itECVE:itTree.node->data->measurements.fECVE)
				extractECVEROMObs(rm, itECVE);

			//In every node iterate through the ORIEROM's measurements
			for (auto& itORIE:itTree.node->data->measurements.fORIE)
				extractORIEROMObs(rm, itORIE);

			//Extract vertical distance DVER residuals
			extractDVERObs(rm, itTree.node->data->measurements.fDVER);

			//Extract pdor residuals
			extractPDORObs(rm, itTree.node->data->measurements.fPDOR);

			//Extract radi residuals
			extractRADIObs(rm, itTree.node->data->measurements.fRADI);
		}
	}
	catch(std::exception const & excp) {
		fDataSet->getFileLogger() << TFileLogger::e_logType::LOG_ERROR <<  excp.what();
		successfullExtraction = false;
	}
	return successfullExtraction;
}

void TLSResultsMatricesExtractor::extractVarCovarParams(const TLSResultsMatrices& rm)
{
	extractPointVarCovar(rm);
	extractAngleVar(rm);
	extractLengthVar(rm);
	extractPlaneVarCovar(rm);
	extractTransformationVarCovar(rm);
}

//////////////////////////////////////////////////////////////////
// PRIVATE METHODS
//////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////
// Methods relative to the measurements (observations)
///////////////////////////////////////////////////////////////
void TLSResultsMatricesExtractor::extractAngleObs(const TLSResultsMatrices& rm, TAScalarMeas<TInstrumentData::TPOLAR::TTarget, ENoValues, 0, ESingleValue, 1>& anglMeas){
	MatrixIndex i = anglMeas.getFirstObservationIndex();
	if ( i < rm.getResidualsVctr()->size() ) {
		TAngle res(rm.getResidualsVctrElmt(i), TAngle::kRadians);
		anglMeas.setAngleResidual(res);
	}
	else
		throw std::runtime_error("Angle observation, problem during extraction residuals: observation index exceeds matrix dimensions");
}

void TLSResultsMatricesExtractor::extractDistObs(const TLSResultsMatrices& rm, TAScalarMeas<TInstrumentData::TPOLAR::TTarget>& distanceMeas){
	MatrixIndex i = distanceMeas.getFirstObservationIndex();
	if ( i < rm.getResidualsVctr()->size() ) 
		distanceMeas.setDistanceResidual(TLength(rm.getResidualsVctrElmt(i)));
	else
		throw std::runtime_error("Distance observation made by a TSTN, problem during extraction residuals: observation index exceeds matrix dimensions");
}

void TLSResultsMatricesExtractor::extractDSPTObs(const TLSResultsMatrices& rm, TAScalarMeas<TInstrumentData::TEDM::TTarget>& distanceMeas){
	MatrixIndex i = distanceMeas.getFirstObservationIndex();
	if ( i < rm.getResidualsVctr()->size() ) 
      distanceMeas.setDistanceResidual(TLength(rm.getResidualsVctrElmt(i)));
	else
		throw std::runtime_error("DSPT observation, problem during extraction residuals: observation index exceeds matrix dimensions");
}

