geodetic-metrology-tools/LGC2/source/LSCalculation/TLSResultsMatricesExtractor.cpp
void TLSResultsMatricesExtractor::extractDistObs(const TLSResultsMatrices& rm, TAScalarMeas<TInstrumentData::TSCALE>& scaleMeas){
	MatrixIndex i = scaleMeas.getFirstObservationIndex();
	if (i < rm.getResidualsVctr()->size())
		scaleMeas.setDistanceResidual(TLength(rm.getResidualsVctrElmt(i)));
	else
		throw std::runtime_error("Distance observation made by a scale, problem during extraction residuals: observation index exceeds matrix dimensions");
}

void TLSResultsMatricesExtractor::extractPLR3DObs(const TLSResultsMatrices& rm, TAScalarMeas<TInstrumentData::TPOLAR::TTarget, ESingleValue, 1, EPLR3DAngles,  2>& plr3DMeas){
	MatrixIndex ANGLidx = plr3DMeas.getFirstObservationIndex();
	if ( ANGLidx < rm.getResidualsVctr()->size() ) {
		TAngle res(rm.getResidualsVctrElmt(ANGLidx), TAngle::kRadians);
		plr3DMeas.setAngleResidual(res, kANGL);
	}
	else
		throw std::runtime_error("PLR3D observation (angl), problem during extraction residuals: observation index exceeds matrix dimensions");

	MatrixIndex ZENDidx = plr3DMeas.getFirstObservationIndex() + 1;
	if ( ZENDidx < rm.getResidualsVctr()->size() ) {
		TAngle res(rm.getResidualsVctrElmt(ZENDidx), TAngle::kRadians);
		plr3DMeas.setAngleResidual(res, kZEND);
	}
	else
		throw std::runtime_error("PLR3D observation (zend), problem during extraction residuals: observation index exceeds matrix dimensions");

	MatrixIndex DISTidx = plr3DMeas.getFirstObservationIndex() + 2;
	if ( DISTidx < rm.getResidualsVctr()->size() ) 
      plr3DMeas.setDistanceResidual(TLength(rm.getResidualsVctrElmt(DISTidx)));
	else
		throw std::runtime_error("PLR3D observation (d), problem during extraction residuals: observation index exceeds matrix dimensions");
}

void TLSResultsMatricesExtractor::extractUVDObs(const TLSResultsMatrices& rm, TUVD& uvdMeas){
	MatrixIndex XcompIDX = uvdMeas.getFirstObservationIndex();
	if ( XcompIDX < rm.getResidualsVctr()->size() ) 
		uvdMeas.setXVectorComponentResidual(rm.getResidualsVctrElmt(XcompIDX));
	else
		throw std::runtime_error("UVD observation (x), problem during extraction residuals: observation index exceeds matrix dimensions");

	MatrixIndex YcompIDX = uvdMeas.getFirstObservationIndex() + 1;
	if ( YcompIDX < rm.getResidualsVctr()->size() ) 
		uvdMeas.setYVectorComponentResidual(rm.getResidualsVctrElmt(YcompIDX));
	else
		throw std::runtime_error("UVD observation (y), problem during extraction residuals: observation index exceeds matrix dimensions");

	MatrixIndex sDistIDX = uvdMeas.getFirstObservationIndex() + 2;
	if ( sDistIDX < rm.getResidualsVctr()->size() ) 
		uvdMeas.setDistanceResidual(TLength(rm.getResidualsVctrElmt(sDistIDX)));
	else
		throw std::runtime_error("UVD observation (d), problem during extraction residuals: observation index exceeds matrix dimensions");
}


void TLSResultsMatricesExtractor::extractUVECObs(const TLSResultsMatrices& rm, TUVEC& uvecMeas){
	MatrixIndex XcompIDX = uvecMeas.getFirstObservationIndex();
	if ( XcompIDX < rm.getResidualsVctr()->size() ) 
		uvecMeas.setXVectorComponentResidual(rm.getResidualsVctrElmt(XcompIDX));
	else
		throw std::runtime_error("UVEC observation, problem during extraction residuals: observation index exceeds matrix dimensions");

	MatrixIndex YcompIDX = uvecMeas.getFirstObservationIndex() + 1;
	if ( YcompIDX < rm.getResidualsVctr()->size() ) 
		uvecMeas.setYVectorComponentResidual(rm.getResidualsVctrElmt(YcompIDX));
	else
		throw std::runtime_error("UVEC observation, problem during extraction residuals: observation index exceeds matrix dimensions");
}


void TLSResultsMatricesExtractor::extractLEVELObs(const TLSResultsMatrices& rm, TLEVEL& levelMeas){
	for(auto itDLEV(levelMeas.measDLEV.begin()); itDLEV != levelMeas.measDLEV.end(); ++itDLEV){
		MatrixIndex obsUidx = itDLEV->getFirstObservationIndex();
		if ( obsUidx < rm.getResidualsVctr()->size() ) 
         itDLEV->setDistanceResidual(TLength(rm.getResidualsVctrElmt(obsUidx)));
		else
			throw std::runtime_error("DHOR observation under DLEV, problem during extraction residuals: observation index exceeds matrix dimensions");

		if(itDLEV->dhor){ //If it is not nullptr
			obsUidx = itDLEV->dhor->getFirstObservationIndex();
			if ( obsUidx < rm.getResidualsVctr()->size() ) 
            itDLEV->dhor->setDistanceResidual(TLength(rm.getResidualsVctrElmt(obsUidx)));
			else
				throw std::runtime_error("DLEV observation, problem during extraction residuals: observation index exceeds matrix dimensions");
		}
	}

}

void TLSResultsMatricesExtractor::extractECHOROMObs(const TLSResultsMatrices& rm, TECHOROM& echoMeas){
	for (auto itECHO(echoMeas.measECHO.begin()); itECHO != echoMeas.measECHO.end(); ++itECHO){
		MatrixIndex obsUidx = itECHO->getFirstObservationIndex();
		if ( obsUidx < rm.getResidualsVctr()->size() ) 
         itECHO->setDistanceResidual(TLength(rm.getResidualsVctrElmt(obsUidx)));
		else
			throw std::runtime_error("ECHO observation, problem during extraction residuals: observation index exceeds matrix dimensions");
	}
}

void TLSResultsMatricesExtractor::extractECSPROMObs(const TLSResultsMatrices& rm, TECSPROM& ecspMeas){
	for (auto& itECSP:ecspMeas.measECSP){
		MatrixIndex obsUidx = itECSP.getFirstObservationIndex();
		if (obsUidx < rm.getResidualsVctr()->size())
			itECSP.setDistanceResidual(TLength(rm.getResidualsVctrElmt(obsUidx)));
		else
			throw std::runtime_error("ECSP observation, problem during extraction residuals: observation index exceeds matrix dimensions");
	}
}

void TLSResultsMatricesExtractor::extractECVEROMObs(const TLSResultsMatrices& rm, TECVEROM& ecveMeas){
	for (auto& itECVE:ecveMeas.measECVE){
		MatrixIndex obsUidx = itECVE.getFirstObservationIndex();
		if (obsUidx < rm.getResidualsVctr()->size())
			itECVE.setDistanceResidual(TLength(rm.getResidualsVctrElmt(obsUidx)));
		else
			throw std::runtime_error("ECVE observation, problem during extraction residuals: observation index exceeds matrix dimensions");
	}
}

void TLSResultsMatricesExtractor::extractORIEROMObs(const TLSResultsMatrices& rm, TORIEROM& orieMeas){
	for (auto& itORIE:orieMeas.measORIE){
		MatrixIndex obsUidx = itORIE.getFirstObservationIndex();
		if (obsUidx < rm.getResidualsVctr()->size())
			itORIE.setAngleResidual(TAngle(rm.getResidualsVctrElmt(obsUidx),TAngle::EUnits::kRadians));
		else
			throw std::runtime_error("ORIE observation, problem during extraction residuals: observation index exceeds matrix dimensions");
	}
}

void TLSResultsMatricesExtractor::extractDVERObs(const TLSResultsMatrices& rm, std::vector<TDVER>& dver){
	for(auto itDVER(dver.begin()); itDVER != dver.end(); ++itDVER){
		MatrixIndex obsUidx = itDVER->getFirstObservationIndex();
		if ( obsUidx < rm.getResidualsVctr()->size() ) 
         itDVER->setDistanceResidual(TLength(rm.getResidualsVctrElmt(obsUidx)));
		else
			throw std::runtime_error("DVER observation, problem during extraction residuals: observation index exceeds matrix dimensions");
	}
}

