geodetic-metrology-tools/LGC2/source/LSCalculation/TLSResultsMatricesExtractor.cpp
void TLSResultsMatricesExtractor::extractPDORObs(const TLSResultsMatrices& rm, TPdorObs& pdorObs){
	MatrixIndex obsUidx = pdorObs.getFirstObservationIndex();
	if (obsUidx < rm.getResidualsVctr()->size())
		pdorObs.setAngleResidual(TAngle(rm.getResidualsVctrElmt(obsUidx), TAngle::EUnits::kRadians));
	else
		throw std::runtime_error("PDOR observation, problem during extraction residuals: observation index exceeds matrix dimensions");
}

void TLSResultsMatricesExtractor::extractRADIObs(const TLSResultsMatrices& rm, std::vector<TRADI>& radi){
	for (auto& itRADI:radi){
		MatrixIndex obsUidx = itRADI.getFirstObservationIndex();
		if (obsUidx < rm.getResidualsVctr()->size())
			itRADI.setResidual(TLength(rm.getResidualsVctrElmt(obsUidx)));
		else
			throw std::runtime_error("RADI observation, problem during extraction residuals: observation index exceeds matrix dimensions");
	}
}

///////////////////////////////////////////////////////////////
// Methods relative to the adjustable objects
///////////////////////////////////////////////////////////////
bool TLSResultsMatricesExtractor::extractPointParams(const TLSResultsMatrices& rm, const TReal convCrit)  {
	bool critNotExceeded = true;

	for (auto& point : fDataSet->getPoints()){
		if(point.hasVariable()){
			for(int unknIdx = point.getFirstUidx(); unknIdx <= point.getLastUidx(); ++unknIdx){
				if (unknIdx >= rm.getSolutionVctr()->size())
					throw std::runtime_error("Unknown index of an angle: " + point.getName() + " exceeds matrix dimensions!");

				TReal correction = rm.getSolutionVctrElmt(unknIdx);
				point.setCorrection(unknIdx, correction);

				if ( fabsq(correction) > convCrit )
					critNotExceeded = false;
			}
		}
	}
#if 0
	/*
		Update estimated center of gravity, to be added into TLGCData class???

		// update the estimated centre of Gravity for the data points
		xcg = xcg + (iterB->getEstimatedValue().getX() * factor);
		ycg = ycg + (iterB->getEstimatedValue().getY() * factor);
		zcg = zcg + (iterB->getEstimatedValue().getZ() * factor);
	*/
#endif
	if(fDataSet->getConfig().libre.isActive())
	{
		throw std::runtime_error("LIBR option is not implemented yet!");
		/*
			Do some staff :: To be implemented later.
		*/
		/*TLSConstraintIdentifier cnstr = fDataSet->getFreeConstraints();
		cnstr.setEstimatedGravityCenterCoord(xcg, ycg, zcg);
		fDataSet->setFreeConstraints(cnstr);*/
	}
	return critNotExceeded;
}

bool TLSResultsMatricesExtractor::extractAngleParams(const TLSResultsMatrices& rm, const TReal convCrit) {
	bool critNotExceeded = true;

	for (auto& angle : fDataSet->getAngles()){
		if(!angle.isFixed()){
				MatrixIndex	unknIdx = angle.getFirstUidx();	//first=last only one unknown fo angle class

				if (unknIdx >= rm.getSolutionVctr()->size())
					throw std::runtime_error("Unknown index of an angle: " + angle.getName() + " exceeds matrix dimensions!");

				TReal	correctionVal = rm.getSolutionVctrElmt(unknIdx);
				angle.setCorrection(unknIdx, correctionVal);
				if ( fabsq(correctionVal) > convCrit )
					critNotExceeded = false;			
		}
	}
	return critNotExceeded;
}


bool TLSResultsMatricesExtractor::extractPlaneParams(const TLSResultsMatrices& rm, const TReal convCrit){
	bool critNotExceeded = true;

	for (auto& plane : fDataSet->getPlanes()){
		if(plane.hasVariable()){
			for(int unknIdx = plane.getFirstUidx(); unknIdx <= plane.getLastUidx(); unknIdx++){
					if (unknIdx >= rm.getSolutionVctr()->size())
						throw std::runtime_error("Unknown index of a plane: " + plane.getName() + " exceeds matrix dimensions!");

					TReal	correction = rm.getSolutionVctrElmt(unknIdx);
					plane.setCorrection(unknIdx, correction);
					if (fabsq(correction) > convCrit)
						critNotExceeded = false;		
			}
		}
	}
	return critNotExceeded;
}
	
bool TLSResultsMatricesExtractor::extractLineParams(const TLSResultsMatrices& rm, const TReal convCrit){
	bool critNotExceeded = true;

	for (auto& line : fDataSet->getLines()){
		if (!line.isFixed()){
			for (int unknIdx = line.getFirstUidx(); unknIdx <= line.getLastUidx(); unknIdx++){
				if (unknIdx >= rm.getSolutionVctr()->size())
					throw std::runtime_error("Unknown index of a plane: " + line.getName() + " exceeds matrix dimensions!");

				TReal	correction = rm.getSolutionVctrElmt(unknIdx);
				line.setCorrection(unknIdx, correction);
				if (fabsq(correction) > convCrit)
					critNotExceeded = false;
			}
		}
	}
	return critNotExceeded;
}

bool TLSResultsMatricesExtractor::extractLengthParams(const TLSResultsMatrices& rm, const TReal convCrit){
	bool critNotExceeded = true;
	for (auto& length : fDataSet->getLength()){
		if(!length.isFixed()){
				MatrixIndex unknIdx = length.getFirstUidx();	//first=last only one unknown fo angle class

				if (unknIdx >= rm.getSolutionVctr()->size())
					throw std::runtime_error("Unknown index of a scalar: " + length.getName() + " exceeds matrix dimensions!");

				TReal	correction = rm.getSolutionVctrElmt(unknIdx);
				length.setCorrection(unknIdx, correction);
				if ( fabsq(correction) > convCrit )
					critNotExceeded = false;			
		}
	}
	return critNotExceeded;
}

bool TLSResultsMatricesExtractor::extractTransformationParams(const TLSResultsMatrices& rm, const TReal convCrit){
	bool critNotExceeded = true;

	for (auto it(fDataSet->getTree().begin()); it != fDataSet->getTree().end(); ++it){	
		auto& trafo(it.node->data.get()->frame);

		if(trafo.hasVariable()){
			for(int unknIdx = trafo.getFirstUidx(); unknIdx <= trafo.getLastUidx(); unknIdx++){
				if (unknIdx >= rm.getSolutionVctr()->size())
					throw std::runtime_error("Unknown index of a transformation: " + trafo.getName() + " exceeds matrix dimensions!");

				TReal	correction = rm.getSolutionVctrElmt(unknIdx);
				trafo.setCorrection(unknIdx, correction);
				if (fabsq(correction) > convCrit)
					critNotExceeded = false;	
			}
		}
	}
	return critNotExceeded;
}


//////////////////////////////////////////////////////////////////////////////
// Returns the boolean that indicates if a new iteration is necessary or not
//////////////////////////////////////////////////////////////////////////////
bool	TLSResultsMatricesExtractor::lastIteration() const {

	return fLastIteration;
}

//////////////////////////////////////////////////////////////////////////////////
// extract var. and covar. params
//////////////////////////////////////////////////////////////////////////////////
void TLSResultsMatricesExtractor::extractPointVarCovar(const TLSResultsMatrices& rm)
{
	for (auto& point : fDataSet->getPoints()){
		if(point.hasVariable()){
			//Filling standard deviations (estimated precision)
			for(int unknIdx = point.getFirstUidx(); unknIdx <= point.getLastUidx(); ++unknIdx){
				if (unknIdx >= rm.getUnkCovarMtrx()->rows())
					throw std::runtime_error("Unknown index of a point: " + point.getName() + " exceeds matrix dimensions!");

