geodetic-metrology-tools/LGC2/source/LSCalculation/TLSResultsMatricesExtractor.cpp
				TReal sigma = sqrtq(rm.getUnkCovarMtrxElmt(unknIdx,unknIdx));	//Set standard deviation in metres [m], sqrt(variance)
				point.setEstimatedPrecision(unknIdx,sigma);
			}
			//Filling XY covariance
			if(!point.isCoordinateFixed(0) && !point.isCoordinateFixed(1)){
				int xi = point.getCoordinateUnknIndex(0);
				int yi = point.getCoordinateUnknIndex(1);
				if ( (xi >= rm.getUnkCovarMtrx()->rows()) || (yi >= rm.getUnkCovarMtrx()->rows()) )
					throw std::runtime_error("Unknown index of a point: " + point.getName() + " exceeds matrix dimensions!");
				point.setXYEstimatedCovariance(rm.getUnkCovarMtrxElmt(xi,yi)); //Here it is multiplied by a factor of 1000 in LGC1 , weird
			}
			//Filling YZ covariance
			if(!point.isCoordinateFixed(1) && !point.isCoordinateFixed(2)){
				int yi = point.getCoordinateUnknIndex(1);
				int zi = point.getCoordinateUnknIndex(2);
				if ( (yi >= rm.getUnkCovarMtrx()->rows()) || (zi >= rm.getUnkCovarMtrx()->rows()) )
					throw std::runtime_error("Unknown index of a point: " + point.getName() + " exceeds matrix dimensions!");
				point.setYZEstimatedCovariance(rm.getUnkCovarMtrxElmt(yi,zi) ); //Here it is multiplied by a factor of 1000 in LGC1 , weird
			}
			//Filling XZ covariance
			if(!point.isCoordinateFixed(0) && !point.isCoordinateFixed(2)){
				int xi = point.getCoordinateUnknIndex(0);
				int zi = point.getCoordinateUnknIndex(2);
				if ( (xi >= rm.getUnkCovarMtrx()->rows()) || (zi >= rm.getUnkCovarMtrx()->rows()) )
					throw std::runtime_error("Unknown index of a point: " + point.getName() + " exceeds matrix dimensions!");
				point.setXZEstimatedCovariance(rm.getUnkCovarMtrxElmt(xi,zi) );//Here it is multiplied by a factor of 1000 in LGC1 , weird 
			}
		}
	}
}

void TLSResultsMatricesExtractor::extractAngleVar(const TLSResultsMatrices& rm)
{
	for (auto& angle : fDataSet->getAngles()){
		if(!angle.isFixed()){
			//Filling standard deviations (estimated precision)
			int unknIdx = angle.getFirstUidx(); 
			if (unknIdx >= rm.getUnkCovarMtrx()->rows())
				throw std::runtime_error("Unknown index of an angle: " + angle.getName() + " exceeds matrix dimensions!");
			angle.setEstimatedPrecision(unknIdx, sqrtq(rm.getUnkCovarMtrxElmt(unknIdx,unknIdx))); //Set estimated precision in RADs
		}
	}
}

void TLSResultsMatricesExtractor::extractLengthVar(const TLSResultsMatrices& rm)
{
	for (auto& length : fDataSet->getLength()){
		if(!length.isFixed()){
			//Filling standard deviations (estimated precision)
			int unknIdx = length.getFirstUidx(); 
			if (unknIdx >= rm.getUnkCovarMtrx()->rows())
				throw std::runtime_error("Unknown index of a scalar: " + length.getName() + " exceeds matrix dimensions!");
			length.setEstimatedPrecision(unknIdx, sqrtq(rm.getUnkCovarMtrxElmt(unknIdx,unknIdx))); //Set estimated precision in METRES
		}
	}
}

void TLSResultsMatricesExtractor::extractPlaneVarCovar(const TLSResultsMatrices& rm){
	for (auto& plane : fDataSet->getPlanes()){
		if(plane.hasVariable()){
			//Filling standard deviations (estimated precision)
			for(int unknIdx = plane.getFirstUidx(); unknIdx <= plane.getLastUidx(); ++unknIdx){
				if (unknIdx >= rm.getUnkCovarMtrx()->rows())
					throw std::runtime_error("Unknown index of a plane: " + plane.getName() + " exceeds matrix dimensions!");

				TReal sigma = sqrtq(rm.getUnkCovarMtrxElmt(unknIdx,unknIdx));	
				plane.setEstimatedPrecision(unknIdx,sigma); //Store standard deviations in meters (reference point distance ) or radians (angles)
			}

			/* Eventually store covarinace between angles if needed in the future.*/
		}
	}
}

void TLSResultsMatricesExtractor::extractLineVarCovar(const TLSResultsMatrices& rm){
	for (auto& line : fDataSet->getLines()){
		if (!line.isFixed()){
			//Filling standard deviations (estimated precision)
			for (int unknIdx = line.getFirstUidx(); unknIdx <= line.getLastUidx(); ++unknIdx){
				if (unknIdx >= rm.getUnkCovarMtrx()->rows())
					throw std::runtime_error("Unknown index of a plane: " + line.getName() + " exceeds matrix dimensions!");

				TReal sigma = sqrtq(rm.getUnkCovarMtrxElmt(unknIdx, unknIdx));
				line.setLineVectorEstimatedPrecision(unknIdx, sigma); //Store standard deviations in meters (reference point distance ) or radians (angles)
			}

			/* Eventually store covarinace between angles if needed in the future.*/
		}
	}
}

void TLSResultsMatricesExtractor::extractTransformationVarCovar(const TLSResultsMatrices& rm){
	for (auto it(fDataSet->getTree().begin()); it != fDataSet->getTree().end(); ++it){	
		auto& trafo(it.node->data.get()->frame);

		if(trafo.hasVariable()){
			//Filling standard deviations (estimated precision)
			for(int unknIdx = trafo.getFirstUidx(); unknIdx <= trafo.getLastUidx(); unknIdx++){
				if (unknIdx >= rm.getSolutionVctr()->size())
					throw std::runtime_error("Unknown index of a transformation: " + trafo.getName() + " exceeds matrix dimensions!");

				TReal sigma = sqrtq(rm.getUnkCovarMtrxElmt(unknIdx,unknIdx));	
				trafo.setEstimatedPrecision(unknIdx, sigma); //Store standard deviations in METRES
			}
		}

    	//Filling XY covariance of a translation
		if(!trafo.isTranslationFixed(0) && !trafo.isTranslationFixed(1)){
			int xi = trafo.getTranslationUnknIndex(0);
			int yi = trafo.getTranslationUnknIndex(1);
			if ( (xi >= rm.getUnkCovarMtrx()->rows()) || (yi >= rm.getUnkCovarMtrx()->rows()) )
				throw std::runtime_error("Unknown index of translation of a transformation: " + trafo.getName() + " exceeds matrix dimensions!");
			trafo.setXYTranslationCovariance(rm.getUnkCovarMtrxElmt(xi,yi)); //Store covariance in METRES
		}
		//Filling YZ covariance of a translation
		if(!trafo.isTranslationFixed(1) && !trafo.isTranslationFixed(2)){
			int yi = trafo.getTranslationUnknIndex(1);
			int zi = trafo.getTranslationUnknIndex(2);
			if ( (yi >= rm.getUnkCovarMtrx()->rows()) || (zi >= rm.getUnkCovarMtrx()->rows()) )
				throw std::runtime_error("Unknown index of translation of a transformation: " + trafo.getName() + " exceeds matrix dimensions!");
			trafo.setYZTranslationCovariance(rm.getUnkCovarMtrxElmt(yi,zi)); //Store covariance in METRES
		}
		//Filling XZ covariance of a translation
		if(!trafo.isTranslationFixed(0) && !trafo.isTranslationFixed(2)){
			int xi = trafo.getTranslationUnknIndex(0);
			int zi = trafo.getTranslationUnknIndex(2);
			if ( (xi >= rm.getUnkCovarMtrx()->rows()) || (zi >= rm.getUnkCovarMtrx()->rows()) )
				throw std::runtime_error("Unknown index of translation of a transformation: " + trafo.getName() + " exceeds matrix dimensions!");
			trafo.setXZTranslationCovariance(rm.getUnkCovarMtrxElmt(xi,zi)); //Store covariance in METRES
		}


