geodetic-metrology-tools/LGC2/source/LSCalculation/TLSResultsMatricesExtractor.cpp
    	//Filling XY covariance of a rotation
		if(!trafo.isRotationFixed(0) && !trafo.isRotationFixed(1)){
			int xi = trafo.getRotationUnknIndex(0);
			int yi = trafo.getRotationUnknIndex(1);
			if ( (xi >= rm.getUnkCovarMtrx()->rows()) || (yi >= rm.getUnkCovarMtrx()->rows()) )
				throw std::runtime_error("Unknown index of rotation of a transformation: " + trafo.getName() + " exceeds matrix dimensions!");
			trafo.setXYRotationCovariance(rm.getUnkCovarMtrxElmt(xi,yi)); //Store covariance in METRES
		}
		//Filling YZ covariance of a rotation
		if(!trafo.isRotationFixed(1) && !trafo.isRotationFixed(2)){
			int yi = trafo.getRotationUnknIndex(1);
			int zi = trafo.getRotationUnknIndex(2);
			if ( (yi >= rm.getUnkCovarMtrx()->rows()) || (zi >= rm.getUnkCovarMtrx()->rows()) )
				throw std::runtime_error("Unknown index of rotation of a transformation: " + trafo.getName() + " exceeds matrix dimensions!");
			trafo.setYZRotationCovariance(rm.getUnkCovarMtrxElmt(yi,zi)); //Store covariance in METRES
		}
		//Filling XZ covariance of a rotation
		if(!trafo.isRotationFixed(0) && !trafo.isRotationFixed(2)){
			int xi = trafo.getRotationUnknIndex(0);
			int zi = trafo.getRotationUnknIndex(2);
			if ( (xi >= rm.getUnkCovarMtrx()->rows()) || (zi >= rm.getUnkCovarMtrx()->rows()) )
				throw std::runtime_error("Unknown index of rotation of a transformation: " + trafo.getName() + " exceeds matrix dimensions!");
			trafo.setXZRotationCovariance(rm.getUnkCovarMtrxElmt(xi,zi)); //Store covariance in METRES
		}
	}
}
